cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3L1x4_SVD.svd
				<register>
					<name>TIMING</name>
					<description>Timing</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x40000018</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STATE</name>
							<description>Timing State. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>B0OEN</name>
							<description>Bias 0 Offset Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The bias 0 pulse is a full width (minimum 2 RTC cycles).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The bias 0 pulse is delayed 1/2 an RTC cycle and de-asserts 1/2 an RTC cycle early (minimum 3 RTC cycles).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>B1OEN</name>
							<description>Bias 1 Offset Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The bias 1 pulse is a full width (minimum 2 RTC cycles).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The bias 1 pulse is delayed 1/2 an RTC cycle and de-asserts 1/2 an RTC cycle early (minimum 3 RTC cycles).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ZONED</name>
							<description>Zone D Count. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>ZONEC</name>
							<description>Zone C Count. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>ZONEB</name>
							<description>Zone B Count. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>ZONEA</name>
							<description>Zone A Count. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>ZONEP</name>
							<description>Zone P Count. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>WAKEMD</name>
							<description>LC Wake Mode. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable wake up events.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WZONEP</name>
									<description>Wake or interrupt at the start of zone P.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WZONEA</name>
									<description>Wake or interrupt at the start of zone A.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WZONEB</name>
									<description>Wake or interrupt at the start of zone B.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WZONEC</name>
									<description>Wake or interrupt at the start of zone C.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WZONED</name>
									<description>Wake or interrupt at the start of zone D.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WEND</name>
									<description>Wake or interrupt at the end of the LC sequence.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WKSTOP</name>
									<description>Wake or interrupt at the end of the LC sequence and stop the sequencer when this event occurs.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>START</name>
							<description>Sequencer Start. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not start the sequencer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Start the sequencer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PERIOD</name>
							<description>Pulse Counter Period. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>4_CYCLES</name>
									<description>Set the period to 4 RTC cycles.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_CYCLES</name>
									<description>Set the period to 8 RTC cycles.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_CYCLES</name>
									<description>Set the period to 16 RTC cycles.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_CYCLES</name>
									<description>Set the period to 32 RTC cycles.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64_CYCLES</name>
									<description>Set the period to 64 RTC cycles.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128_CYCLES</name>
									<description>Set the period to 128 RTC cycles.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>256_CYCLES</name>
									<description>Set the period to 256 RTC cycles.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>512_CYCLES</name>
									<description>Set the period to 512 RTC cycles.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1024_CYCLES</name>
									<description>Set the period to 1024 RTC cycles.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2048_CYCLES</name>
									<description>Set the period to 2048 RTC cycles.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4096_CYCLES</name>
									<description>Set the period to 4096 RTC cycles.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SINGLE_SAMPLE</name>
									<description>Set the module to single sample mode and disable the period counter after the next completion of the sequencer.  In this mode, firmware must start each sample by setting FLCSEN to 1. </description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONSECUTIVE_SAMPLE</name>
									<description>Set the module to consecutive sample mode and disable the period counter. After completing zone D, the timing engine will jump directly to zone A, skipping both the W and P zones.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
