cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3L1x4_SVD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>LDO_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>LDO_0</groupName>
			<baseAddress>0x40039000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00343434</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ALDOOVAL</name>
							<description>Analog LDO Output Value Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>ALDOBSEL</name>
							<description>Analog LDO Bias Select. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Select a low bias for the analog LDO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Select a high bias for the analog LDO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALDOSSEL</name>
							<description>Analog LDO Source Select. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>VBAT</name>
									<description>Select the VBAT pin as the input voltage to the analog LDO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DCDC</name>
									<description>Select the output of the DC-DC converter as the input voltage to the analog LDO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MLDOOVAL</name>
							<description>Memory LDO Output Value Select. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>MLDOBSEL</name>
							<description>Memory LDO Bias Select. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Select a low bias for the memory LDO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Select a high bias for the memory LDO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MLDOSSEL</name>
							<description>Memory LDO Source Select. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>VBAT</name>
									<description>Select the VBAT pin as the input voltage to the memory LDO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DCDC</name>
									<description>Select the output of the DC-DC converter as the input voltage to the memory LDO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DLDOOVAL</name>
							<description>Digital LDO Output Value Select. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>DLDOBSEL</name>
							<description>Digital LDO Bias Select. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Select a low bias for the digital LDO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Select a high bias for the digital LDO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DLDOSSEL</name>
							<description>Digital LDO Source Select. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>VBAT</name>
									<description>Select the VBAT pin as the input voltage to the digital LDO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DCDC</name>
									<description>Select the output of the DC-DC converter as the input voltage to the digital LDO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>LOCK_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>LOCK_0</groupName>
			<baseAddress>0x40049000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>KEY</name>
					<description>Security Key</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>KEY</name>
							<description>Peripheral Lock Mask Key. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>PERIPHLOCK registers are locked and no valid values have been written to KEY.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERMEDIATE</name>
									<description>PERIPHLOCK registers are locked and the first valid value (0xA5) has been written to KEY.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>PERIPHLOCK registers are unlocked. Any subsequent writes to KEY will lock the interface.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
