cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3L1x4_SVD.svd
				<register>
					<name>PERIPHLOCK0</name>
					<description>Peripheral Lock Control 0</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>USARTL</name>
							<description>USART/UART Module Lock Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the USART0 and UART0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the USART0 and UART0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPIL</name>
							<description>SPI Module Lock Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the SPI0 and SPI1 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the SPI0 and SPI1 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2CL</name>
							<description>I2C Module Lock Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the I2C0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the I2C0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCAL</name>
							<description>PCA Module Lock Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the EPCA0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the EPCA0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMERL</name>
							<description>Timer Module Lock Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the TIMER0, TIMER1, and TIMER2 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the TIMER0, TIMER1, and TIMER2 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SARADCL</name>
							<description>SARADC Module Lock Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the SARADC0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the SARADC0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPL</name>
							<description>Comparator Module Lock Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Comparator 0 and Comparator 1 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Comparator 0 and Comparator 1 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AESL</name>
							<description>AES Module Lock Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the AES0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the AES0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CRCL</name>
							<description>CRC Module Lock Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the CRC0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the CRC0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTCL</name>
							<description>RTC Module Lock Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the RTC0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the RTC0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RSTSRCL</name>
							<description>Reset Sources Module Lock Enable. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Reset Sources (RSTSRC) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Reset Sources (RSTSRC) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKCTRL</name>
							<description>Clock Control Lock Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Clock Control (CLKCTRL)Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Clock Control (CLKCTRL) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VMONL</name>
							<description>Voltage Supply Monitor Module Lock Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Voltage Supply Monitor (VMON0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Voltage Supply Monitor (VMON0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDACL</name>
							<description>IDAC Module Lock Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the IDAC0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the IDAC0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMACTRLL</name>
							<description>DMA Controller Module Lock Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the DMA Controller (DMACTRL0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the DMA Controller (DMACTRL0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMAXBARL</name>
							<description>DMA Crossbar Module Lock Enable. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the DMA Crossbar (DMAXBAR0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the DMA Crossbar (DMAXBAR0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LPTL</name>
							<description>Low Power Timer Module Lock Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Low Power Timer (LPTIMER0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Low Power Timer (LPTIMER0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LDOL</name>
							<description>Voltage Reference Module Lock Enable. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the LDO0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the LDO0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLLL</name>
							<description>PLL Module Lock Enable. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the PLL0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the PLL0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTOSCL</name>
							<description>External Oscillator Module Lock Enable. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the External Oscillator (EXTOSC0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the External Oscillator (EXTOSC0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PVTL</name>
							<description>PVT Oscillator Module Lock Enable. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the PVTOSC0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the PVTOSC0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LPOSCL</name>
							<description>Low Power Oscillator Lock Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Low Power Oscillator (LPOSC0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Low Power Oscillator (LPOSC0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACCTRL</name>
							<description>Advanced Capture Counter  Module Lock. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Advanced Capture Counter (ACCTR0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Advanced Capture Counter (ACCTR0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMUL</name>
							<description>PMU Module Lock Enable. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the PMU Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the PMU Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTML</name>
							<description>DTM Module Lock. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the DTM0, DTM1, and DTM2 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the DTM0, DTM1, and DTM2 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LCDL</name>
							<description>LCD Module Lock. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the LCD0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the LCD0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCDCL</name>
							<description>DC-DC Converter Module Lock. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the DCDC0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the DCDC0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PERIPHLOCK1</name>
					<description>Peripheral Lock Control 1</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENCDECL</name>
							<description>Encoder Decoder Module Lock. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the ENCDEC0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the ENCDEC0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
