cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3L1x4_SVD.svd
				<register>
					<name>XBAR0</name>
					<description>Crossbar 0 Control</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>USART0EN</name>
							<description>USART0 Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable USART0 RX and TX on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable USART0 RX and TX on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USART0FCEN</name>
							<description>USART0 Flow Control Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable USART0 flow control on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable USART0 flow control on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USART0CEN</name>
							<description>USART0 Clock Signal Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable USART0 clock on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable USART0 clock on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMA0T0EN</name>
							<description>DMA Trigger 0 Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the DMA trigger 0 on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the DMA trigger 0 on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMA0T1EN</name>
							<description>DMA Trigger 1 Enabled. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the DMA trigger 1 on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the DMA trigger 1 on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDAC0TEN</name>
							<description>IDAC0 Trigger Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the IDAC0 trigger on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the IDAC0 trigger on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI0EN</name>
							<description>SPI0 Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable SPI0 SCK, MISO, and MOSI on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable SPI0 SCK, MISO, and MOSI on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI0NSSEN</name>
							<description>SPI0 NSS Pin Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable SPI0 NSS on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable SPI0 NSS on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPCA0EN</name>
							<description>EPCA0 Channel Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>Disable all EPCA0 channels on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CEX0_0</name>
									<description>Enable EPCA0 CEX0 on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CEX0_1</name>
									<description>Enable EPCA0 CEX0 and CEX1 on Crossbar 0.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CEX0_2</name>
									<description>Enable EPCA0 CEX0, CEX1, and CEX2 on Crossbar 0.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CEX0_3</name>
									<description>Enable EPCA0 CEX0, CEX1, CEX2, and CEX3 on Crossbar 0.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CEX0_4</name>
									<description>Enable EPCA0 CEX0, CEX1, CEX2, CEX3, and CEX4 on Crossbar 0.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CEX0_5</name>
									<description>Enable EPCA0 CEX0, CEX1, CEX2, CEX3, CEX4, and CEX5 on Crossbar 0.</description>
									<value>6</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EECI0EN</name>
							<description>EPCA0 ECI Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable EPCA0 ECI on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable EPCA0 ECI on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2C0EN</name>
							<description>I2C0 Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable I2C0 SDA and SCL on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable I2C0 SDA and SCL on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP0SEN</name>
							<description>Comparator 0 Synchronous Output (CMP0S) Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Comparator 0 Synchronous Output (CMP0S) on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Comparator 0 Synchronous Output (CMP0S) on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP0AEN</name>
							<description>Comparator 0 Asynchronous Output (CMP0A) Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Comparator 0 Asynchronous Output (CMP0A) on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Comparator 0 Asynchronous Output (CMP0A) on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP1SEN</name>
							<description>Comparator 1 Synchronous Output (CMP1S) Enable. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Comparator 1 Synchronous Output (CMP1S) on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Comparator 1 Synchronous Output (CMP1S) on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP1AEN</name>
							<description>Comparator 1 Asynchronous Output (CMP1A) Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Comparator 1 Asynchronous Output (CMP1A) on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Comparator 1 Asynchronous Output (CMP1A) on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMR0CTEN</name>
							<description>TIMER0 T0CT Enable. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable TIMER0 CT on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable TIMER0 CT on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMR0EXEN</name>
							<description>TIMER0 T0EX Enable. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable TIMER0 EX on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable TIMER0 EX on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMR1CTEN</name>
							<description>TIMER1 T1CT Enable. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable TIMER1 CT on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable TIMER1 CT on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMR1EXEN</name>
							<description>TIMER1 T1EX Enable. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable TIMER1 EX on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable TIMER1 EX on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SARADC0TEN</name>
							<description>SARADC0 Trigger Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable SARADC0 conversion start trigger on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable SARADC0 conversion start trigger on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AHBEN</name>
							<description>AHB Clock Output Enable. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the AHB Clock / 16 output on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the AHB Clock / 16 output on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XBAR0EN</name>
							<description>Crossbar 0 Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PBKEY</name>
					<description>Global Port Key</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>KEY</name>
							<description>Port Bank Key. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Port Bank registers are locked and no valid values have been written to PBKEY.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERMEDIATE</name>
									<description>Port Bank registers are locked and the first valid value (0xA5) has been written to PBKEY.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Port Bank registers are unlocked. Any subsequent writes to the Port Bank registers or PBKEY will lock the interface.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
